package cn.treedeep.link.protocol.v1;

import lombok.Data;

/**
 * Copyright © 深圳市树深计算机系统有限公司 版权所有
 *
 * <p>协议帧结构说明：</p>
 * <pre>
 * ┌──────────────┬──────────────┬──────────────┬──────────────────────────────┐
 * │ 协议组件      │ 字段名称       │ 长度(字节)    │ 说明                          │
 * ├──────────────┼──────────────┼──────────────┼──────────────────────────────┤
 * │ 协议头        │ 起始符        │ 2            │ 固定0xAA55                    │
 * │              │ 协议版本      │ 1            │ 当前版本0x01                   │
 * │              │ 协议总长度     │ 2            │ 大端序格式                     │
 * │              │ 指令          │ 1            │ 具体指令查看文档。              │
 * ├──────────────┼──────────────┼──────────────┼──────────────────────────────┤
 * │ 数据域        │ 设备ID        │ 4            │ 设备唯一标识                   │
 * │              │ 会话ID        │ 2            │ 动态会话标识                   │
 * │              │ 任务ID        │ 4            │ 小程序业务ID                   │
 * │              │ 扩展数据       │ 变长         │ [数据体]                      │
 * ├──────────────┼──────────────┼──────────────┼──────────────────────────────┤
 * │ 协议尾        │ CRC16校验     │ 2            │ CCITT标准                     │
 * │              │ 结束符        │ 2            │ 固定0x55AA                    │
 * └──────────────┴──────────────┴──────────────┴──────────────────────────────┘
 * </pre>
 *
 * @author 周广明
 * @since 2025/3/30 08:53
 */
@Data
public abstract class Pv1BaseFrame implements Protocol {
    private byte version = PROTOCOL_VERSION;
    private byte command;
    private int deviceId;
    private short sessionId;
    private int taskId;

    public abstract byte getCommand();
}
